package tests;

public class Test_01_first {
    public static void main(int VAR)
    {
        int _var = VAR;
        System.out.print("1 тест\n<<ДОСЛІДЖЕННЯ ПРАВОВИХ ТА ОРГАНІЗАЦІЙНИХ ОСНОВ ЗАКОНОДАВСТВА УКРАЇНИ З ОХОРОНИ НАВКОЛИШНЬОГО СЕРЕДОВИЩА. РОЗРАХУНОК ЕКОЛОГІЧНОГО ПОДАТКУ>>"
        + "\nВариант " + _var + "\n");
        if (_var == 1)
        {
            System.out.print("01 - 5. ноосферою.\n");
            System.out.print("02 - 2. Підвищення потужностей ресурсоємних виробництв;\n");
            System.out.print("03 - 3. Підвищення кількостей енергоємних виробництв.\n");
            System.out.print("04 - 1. Енергетична проблема. \n");
            System.out.print("05 - 5. Кращі шанси до самозбереження в конкуренції мають ті організми, що допомагають максимальному надходженню та використанню енергії та інформації.");
            System.out.print("06 - 1. «Про засади внутрішньої і зовнішньої політики»\n");
            System.out.print("07 - 3. У підвищенні температури біля поверхні Землі\n");
            System.out.print("08 - 3. Циклонах\n");
            System.out.print("09 - 1. Санітарно-захисною зоною\n");
            System.out.print("10 - 2. 50 м\n");
        }
        else if (_var == 2)
        {
            System.out.print("01 - 5. Ю.А. Ізраель.\n");
            System.out.print("02 - 4. Повне знешкодження всіх видів відходів до їхнього надходження до навколишнього середовища.\n");
            System.out.print("03 - 1. Загальна захворюваність населення.\n");
            System.out.print("04 - 3. Лімітуючим фактором процвітання організму (виду) може бути як мінімум так і максимум екологічного фактора.\n");
            System.out.print("05 - 1. Еволюція структури;\n");
            System.out.print("06 - 2. Дендрологічні та зоологічні парки;\n");
            System.out.print("07 - 2. Розкладання діоксиду азоту під дією ультрафіолетового випромінювання\n");
            System.out.print("08 - 4. Електрофільтри\n");
            System.out.print("09 - 2. 1000 м\n");
            System.out.print("10 - 4. Σподатків за охорону різних об’єктів історико-культурної спадщини;\n");
        }
    }
}
