package tests;

public class Test_16_sixteenth {

    public static void main(int VAR) {
        int _var = VAR;
        switch (_var) {
            // case (1), (2), (3), (4), (5) -> {}
            case (6), (11), (16), (21), (26) -> _var = 1;
            case (7), (12), (17), (22), (27) -> _var = 2;
            case (8), (13), (18), (23), (28) -> _var = 3;
            case (9), (14), (19), (24), (29) -> _var = 4;
            case (10), (15), (20), (25), (30) -> _var = 5;
        }
        System.out.print("Дополнительный тест №1\n<<Менеджмент безпеки>>"
                + "\nВариант " + _var + "\n");

        if (_var == 1) {
            System.out.println("01. 5. принцип слабої ланки.");
            System.out.println("02. 3. своєчасне оповіщення для правильної реакції населення");
            System.out.println("03. 1. Запобігання виникнення НС\n");
            System.out.println("04. 2. Зменшення можливих матеріальних втрат у разі НС");
            System.out.println("05. 2. навчання населення діям в аварійних ситуаціях");
            System.out.println("06. 3. йодна профілактика; вживання радіопротекторів;часткова дезактивація одягу і взуття;");
            System.out.println("07. 5. розробку планів діяльності та дій всіх складових функціональної та територіальної підсистем ЄДС ЦЗ.");
            System.out.println("08. 5. ідентифікація та декларування об’єктів господарювання (ОГ) підвищеної небезпеки");
            System.out.println("09. 1. збір даних про обстановку; аналіз і оцінка обстановки;");
            System.out.println("10. 1. яка має прихований характер і може перетворитися в реальну небезпеку за наявності трьох умов;");
        }
    }
}
