package com.hecate.labs;

import java.util.Scanner;

public class Lab_08_eight {

    private static int num;

    static public void Zero()
    {
        /* ПЕРВОЕ ЗАДАНИЕ */
        System.out.println("1. Принципи державної політики в галузі охорони праці");
        System.out.println("=======================================================");
        System.out.println("    01. Принцип пріоритету життя і здоров’я працівників, повної відповідальності власника за \n" +
                "       створення безпечних і нешкідливих умов праці;");
        System.out.println("    02. Принцип підвищення рівня промислової безпеки шляхом забезпеченням суцільного\n" +
                "       технічного контролю за станом виробництв, технологій та продукції, а також\n" +
                "       сприяння підприємствам у створенні безпечних та нешкідливих умов праці;");
        System.out.println("    03. Принцип комплексного розв’язання завдань охорони праці на основі загальнодержавної,\n" +
                "галузевих, регіональних програм з цього питання та з урахуванням інших\n" +
                "напрямків економічної і соціальної політики, досягнень в галузі науки і техніки та\n" +
                "охорони навколишнього середовища;");
        System.out.println("    04. Принцип соціального захисту працівників, повного відшкодування шкоди особам, які\n" +
                "       потерпіли від нещасних випадків та професійних захворювань;");
        System.out.println("    05. Принцип встановлення єдиних нормативів з охорони праці для всіх підприємств,\n" +
                "       незалежно від форм власності і видів їх діяльності;");
        System.out.println("    06. Принцип встановлення єдиних нормативів з охорони праці для всіх підприємств,\n" +
                "       незалежно від форм власності і видів їх діяльності;");
        System.out.println("    07. Принцип інформування населення, проведення навчання, професійної підготовки і\n" +
                "       підвищення кваліфікації працівників з питань охорони праці;");
        System.out.println("    08. Принцип забезпечення координації діяльності державних органів, установ, організацій\n" +
                "       та об’єднань громадян, що вирішують різні проблеми охорони здоров’я, гігієни та безпеки праці, а також\n" +
                "       співробітництва і проведення консультацій між власниками та працівниками, між усіма соціальними групами\n" +
                "       при прийнятті рішень з охорони праці на місцевому та державному рівнях;");
        System.out.println("    09. Принцип адаптації трудових процесів до можливостей працівника з урахуванням\n" +
                "       його здоров'я та психологічного стану;");
        System.out.println("    10. Принцип міжнародного співробітництва в галузі охорони праці, використання світового досвіду\n" +
                "       організації роботи щодо поліпшення умов і підвищення безпеки праці.");
        System.out.println("=======================================================");
        /* ВТОРОЕ ЗАДАНИЕ */
        System.out.println("2. Нормативно-правовий акт з охорони праці - – це правила, норми, регламенти,\n" +
                "       положення, стандарти, інструкції та інші документи з охорони праці. Вони є\n" +
                "       обов’язковими до виконання і дотримання усіма підприємствами, для яких вони розроблені.");
        System.out.println("=======================================================");
        /* ВТОРАЯ ПОЛОВИНА ВТОРОГО ЗАДАНИЯ */
        System.out.println("ДСН - Державно Санітарні Норми;");
        System.out.println("ДБН - Державні Будівельні Норми;");
        System.out.println("СН - Санітарні Норми;");
        System.out.println("ПУЕ - Правилами Улаштування Електроустановок");
        System.out.println("ДНАОП - Державні Нормативні Акти з Охорони Праці;");
        System.out.println("НПАОП - Нормативно-Правові Акти з питань Охорони Праці;");
        System.out.println("ДСТУ - Державний Стандарт України;");
        System.out.println("=======================================================");
        /* ТРЕТЬЕ ЗАДАНИЕ */
        System.out.println("3. Навчання з охорони праці проводиться у відповідності до відповідних навчальних програм, в яких\n" +
                "       передбачається теоретичне та практичне навчання. Для людей, які будуть працювати в місцях підвищенної небезпеки\n" +
                "       - навчання проводиться тільки в спеціальних зкладах");
        System.out.println("=======================================================");
        /* ЧЕТВЁРТОЕ ЗАДАНИЕ */
        System.out.println("4. Види інструктажів з охорони праці");
        System.out.println("=======================================================");
        System.out.println("    1. Вид інструктажу:");
        System.out.println("        Вступний інструктаж");
        System.out.println("    1. Хто проводить з ким, та кому");
        System.out.println("        Кому проводять:");
        System.out.println("        - З усіми працівниками;");
        System.out.println("        - З працівниками інших організацій, що прибули та беруть участь у виробничому процусі;");
        System.out.println("        - З учнями та студентами, що проходять навчання;");
        System.out.println("        - З єксурсантам;");
        System.out.println("        Ким проводиться:");
        System.out.println("        - Керівником робіт;");
        System.out.println("        - Спеціалістом з охорони праці;");
        System.out.println("        - Фахівцем, що у Установленому Типовому Порядку, пройшов навчання та перевірку знань з охорони праці;");
        System.out.println("    1. Коли та й у який термін проводиться інструктаж");
        System.out.println("        - Після прибуття на підприємство;");
        System.out.println("=======================================================");
        System.out.println("    2. Вид інструктажу:");
        System.out.println("        Первинний інструктаж;");
        System.out.println("    2. Хто проводить з ким, та кому");
        System.out.println("        Кому проводять:");
        System.out.println("        - Новоприйняти працівникам ( тимчасово або постійно ) на підприємство;");
        System.out.println("        - Фізичній особі, що використовує найману роботу;");
        System.out.println("        - Працівником, який переводиться з одного структурного підрозділу підбриємства до іншого;");
        System.out.println("        - Працівником, який буде виконувати нову, для нього, роботу;");
        System.out.println("        - З відрядженим працівником іншого підприємства, який бере безпосередню участь у виробничому процесі на підприєстві;");
        System.out.println("        Ким проводиться:");
        System.out.println("        - Керівником робіт;");
        System.out.println("        - Індивідуально або з групою осіб одного фаху за діючими на підприємстві інструкціями з охорони праці відповідно до виконуваних робіт;");
        System.out.println("    2. Коли та й у який термін проводиться інструктаж");
        System.out.println("        - До початку роботи безпосередньо на робочому місці;");
        System.out.println("=======================================================");
        System.out.println("    3. Вид інструктажу:");
        System.out.println("        Повторний інструктаж");
        System.out.println("    3. Хто проводить з ким, та кому");
        System.out.println("        Кому проводять:");
        System.out.println("        - Окремим працівникам або групою працівників, які виконують однотипну роботу;");
        System.out.println("        Ким проводиться:");
        System.out.println("        - Керівником робіт;");
        System.out.println("        - На робочому місці;");
        System.out.println("    3. Коли та й у який термін проводиться інструктаж");
        System.out.println("        - На роботах з підвищеною небезпекою – 1 раз в три місяця;");
        System.out.println("        - Для інших робіт – 1 раз у шість місяців");
        System.out.println("        - Термін, визначений нормативно правовим актом з охорони праці, які діють у галузі;");
        System.out.println("            - За обсягом і змістом переліку питань первинного інструктажа;");
        System.out.println("=======================================================");
        System.out.println("    4. Вид інструктажу:");
        System.out.println("        Позаплановий інтруктаж;");
        System.out.println("    4. Хто проводить з ким, та кому");
        System.out.println("        Кому проводять:");
        System.out.println("        - З працівниками на робочому місці або в кабінеті охорони праці;");
        System.out.println("        - Учням, студентам, курсантам, слухачам;");
        System.out.println("        - Індивідуально з окремим працівником;");
        System.out.println("        - З групою працівників одного фаху;");
        System.out.println("        Ким проводиться:");
        System.out.println("        - Керівником робіт;");
        System.out.println("            - за необхідністю долучають наступних працівників;");
        System.out.println("            - інженера-еколога;\n" +
                "            - особу, відповідальну за електрогосподарство;\n" +
                "            - особу, відповідальну за протипожежний стан підприємства;\n" +
                "            - інженера з охорони праці;\n" +
                "            - медичного працівника;\n" +
                "            - юриста;\n" +
                "            - фахівця відділу кадрів;");
        System.out.println("    4. Коли та й у який термін проводиться інструктаж");
        System.out.println("        - При введенні в дію нових або переглянутих нормативно-правових актів з " +
                "охорони праці, а також при внесенні змін та доповнень до них;");
        System.out.println("        - При зміні технологічного процесу, заміні або модернізації устаткування, " +
                "приладів та інструментів, вихідної сировини, матеріалів та інших факторів, що " +
                "впливають на стан охорони праці;");
        System.out.println("        - При порушеннях працівниками вимог нормативно-правових актів з охорони " +
                "праці, що призвели до травм, аварій, пожеж тощо;");
        System.out.println("        - При перерві в роботі виконавця робіт більш ніж на 30 календарних " +
                "днів – для робіт з підвищеною небезпекою, а для решти робіт – понад 60 днів;");
        System.out.println("        - Працівникам, які перебувають у відрядженні, відпустці, тимчасово непрацездатні,\n" +
                "           позаплановий інструктаж проводять упродовж двох днів після того, як вони вийшли на роботу.");
        System.out.println("        - Проводиться під час проведення трудового і професійного навчання при порушеннях\n" +
                "           ними вимог нормативно-правових актів з охорони праці, що можуть призвести або " +
                "           призвели до травм, аварій, пожеж тощо.");
        System.out.println("            - Обсяг і зміст позапланового інструктажу визначаються в кожному окремому випадку залежно від причин і обставин,\n" +
                "           що спричинили потребу його проведення.");
        System.out.println("=======================================================");
        System.out.println("    5. Вид інструктажу:");
        System.out.println("        Цільовий інструктаж;");
        System.out.println("    5. Хто проводить з ким, та кому");
        System.out.println("        Кому проводять:");
        System.out.println("        - Індивідуально з окремим працівником;");
        System.out.println("        - З групою працівників;");
        System.out.println("        Ким проводиться:");
        System.out.println("        - Керівником робіт;");
        System.out.println("    5. Коли та й у який термін проводиться інструктаж");
        System.out.println("        - При ліквідації аварії або стихійного лиха;");
        System.out.println("        - При проведенні робіт, на які відповідно до законодавства, оформлюються\n" +
                "           наряд-допуск, наказ або розпорядження.");
        System.out.println("            - Обсяг і зміст цільового інструктажу визначаються залежно від виду робіт, що виконуватимуться.");
        System.out.println("=======================================================");
        System.out.println("Висновки: В ході виконання практичної роботи, я дізнався які види інструктажу та й у які терміни їх потрібно проводити;");
        System.out.println("Роботу виконав: _____");
    }
    static public void main()
    {
        System.out.print("""
                Практичне Заняття № 8\040
                «Законодавство з Основ Охорони Праці»""");
        System.out.print("\n");
        Scanner in = new Scanner(System.in);
        System.out.print("Введите вариант: ");
        num = in.nextInt();
        Zero();
    }
}
