package com.hecate.tests;

public class Test_01_first {
    public static void main(int VAR)
    {
        int _var = VAR;
        System.out.print("1 тест\n<<ДОСЛІДЖЕННЯ ПРАВОВИХ ТА ОРГАНІЗАЦІЙНИХ ОСНОВ ЗАКОНОДАВСТВА УКРАЇНИ З ОХОРОНИ НАВКОЛИШНЬОГО СЕРЕДОВИЩА. РОЗРАХУНОК ЕКОЛОГІЧНОГО ПОДАТКУ>>"
        + "\nВариант " + _var + "\n");
        if (_var == 1)
        {
            System.out.print("01 - 5. ноосферою.\n");
            System.out.print("02 - 2. Підвищення потужностей ресурсоємних виробництв;\n");
            System.out.print("03 - 3. Підвищення кількостей енергоємних виробництв.\n");
            System.out.print("04 - 1. Енергетична проблема. \n");
            System.out.print("05 - 5. Кращі шанси до самозбереження в конкуренції мають ті організми, що допомагають максимальному надходженню та використанню енергії та інформації.");
            System.out.print("06 - 1. «Про засади внутрішньої і зовнішньої політики»\n");
            System.out.print("07 - 3. У підвищенні температури біля поверхні Землі\n");
            System.out.print("08 - 3. Циклонах\n");
            System.out.print("09 - 1. Санітарно-захисною зоною\n");
            System.out.print("10 - 2. 50 м\n");
        }
        else if (_var == 2)
        {
            System.out.print("01 - 5. Ю.А. Ізраель.\n");
            System.out.print("02 - 4. Повне знешкодження всіх видів відходів до їхнього надходження до навколишнього середовища.\n");
            System.out.print("03 - 1. Загальна захворюваність населення.\n");
            System.out.print("04 - 3. Лімітуючим фактором процвітання організму (виду) може бути як мінімум так і максимум екологічного фактора.\n");
            System.out.print("05 - 1. Еволюція структури;\n");
            System.out.print("06 - 2. Дендрологічні та зоологічні парки;\n");
            System.out.print("07 - 2. Розкладання діоксиду азоту під дією ультрафіолетового випромінювання\n");
            System.out.print("08 - 4. Електрофільтри\n");
            System.out.print("09 - 2. 1000 м\n");
            System.out.print("10 - 4. Σподатків за охорону різних об’єктів історико-культурної спадщини;\n");
        }
        else if (_var == 3)
        {
            System.out.println("01. 3. відносини організму з навколишнім середовищем;");
            System.out.println("02. 3. вуглекислого газу");
            System.out.println("03. 1. ботанічні сади;");
            System.out.println("04. 5. \"Про пожежну безпеку\" № 3747-XII від 17.12.93 (редакція станом на 19.11.2012 року).");
            System.out.println("05. 3. оксидів азоту і фреонів;");
            System.out.println("06. 2. Організм (популяція, вид) не може повернутися до попереднього стану, вже здійсненого в ряду його предків.");
            System.out.println("07. 3. необхідне різноманіття елементів системи;");
            System.out.println("08. 5. електрофільтр");
            System.out.println("09. 2. 1000 м");
            System.out.println("10. 3. Правові основи природоохоронної діяльності на територіях (акваторіях), що підлягають особливій охороні");
        }
    }
}
