package labs;

import java.util.Scanner;

public class Lab_13_thirteen {

    static private int num;

    static private int task_2_db;
    static private double task_2_hz;
    static private double max_number;
    static private double task_2_gdr_max;

    static private final String[][] tab_1_strings = new String[][]
    {
            {"Варіант завдання", "Вид трудової діяльності","Граничний спектр","Розташування робочого місця, де вимірюється шум","Джерелашуму"},
            {"01","Творчої діяльності","ГС45","Конструкторське бюро","Кондиціонер"},
            {"02","Високої клаліфікація","ГС55","Кабінет головного інженера","Кондиціонер"},
            {"03","За виробничою ділянкою","ГС75","Токарна ділянка","Вир.устаткув."},
            {"04","Робота з дистанційним керуванням виробничого процесу","ГС70","Оператор ОТК","Вентилятор"},
            {"05","Робота з підвищеними вимогами без мовного зв'язку","ГС60","Диспетчер заводоупр.","Вентилятор"},
            {"06","Творчої діяльності","ГС45","Розрахунковий відділ","Вентилятор"},
            {"07","Високої клаліфікація","ГС55","Техвідділ заводоуправління","Вентилятор"},
            {"08","За виробничою ділянкою","ГС75","Слюсарна ділянка","Вир.устаткув."},
            {"09","Робота з дистанційним керуванням виробничого процесу","ГС70","Оператор управління","Кондиціонер"},
            {"10","Робота з дистанційним керуванням виробничого процесу","ГС60","Диспетчер цеху","Вентилятор"},
            {"11","Творчої діяльності","ГС45","Науково-дослідний відділ","Вентилятор"},
            {"12","Високої клаліфікація","ГС55","Лабораторія заводу","Вентилятор"},
            {"13","За виробничою ділянкою","ГС75","Зварювальна ділянка","Вир.устаткув."},
            {"14","Робота з дистанційним керуванням виробничого процесу","ГС70","Оператор ЕОМ","Кондиціонер"},
            {"15","Робота, з вказівками по телефону","ГС60","Оператор зв'язку","Кондиціонер"},
            {"16","Творчої діяльності","ГС45","Кабінет директора","Кондиціонер"},
            {"17","Високої клаліфікація","ГС55","Техвідділ заводоуправління","Кондиціонер"},
            {"18","За виробничою ділянкою","ГС75","Ливарна ділянка","Вир.устаткув."},
            {"19","Робота з дистанційним керуванням виробничого процесу","ГС70","Кабінет майстра","Кондиціонер"},
            {"20","Робота, з вказівками по телефону","ГС60","Видавничий цех","Кондиціонер"},
            {"21","Творчої діяльності","ГС45","Кімнати програмістів","Кондиціонер"},
            {"22","Високої клаліфікація","ГС55","Кабінет механіка цеху","Вентилятор"},
            {"23","За виробничою ділянкою","ГС75","Фрезерна ділянка","Вир.устаткув."},
            {"24","Робота з дистанційним керуванням виробничого процесу","ГС70","Лабораторія ОТК","Кондиціонер"},
            {"25","Робота, з вказівками по телефону","ГС60","Інформаційний відділ","Кондиціонер"},
            {"26","Творчої діяльності","ГС45","Кабінет директора","Кондиціонер"},
            {"27","Високої клаліфікація","ГС55","Техвідділ заводоуправління","Кондиціонер"},
            {"28","Високої клаліфікація","ГС55","Кабінет механіка цеху","Вентилятор"},
            {"29","За виробничою ділянкою","ГС75","Фрезерна ділянка","Вир.устаткув."},
            {"30","За виробничою ділянкою","ГС75","Слюсарна ділянка","Вир.устаткув."}
    };

    static final int[][] work_enums = new int[][]
            {
                    {	0	,	1	},
                    {	1	,	5	},
                    {	2	,	5	},
                    {	5	,	0	},
                    {	4	,	5	},
                    {	4	,	5	},
                    {	1	,	5	},
                    {	2	,	5	},
                    {	5	,	0	},
                    {	4	,	5	},
                    {	4	,	5	},
                    {	1	,	5	},
                    {	2	,	5	},
                    {	5	,	0	},
                    {	4	,	5	},
                    {	3	,	5	},
                    {	1	,	5	},
                    {	2	,	5	},
                    {	5	,	0	},
                    {	4	,	5	},
                    {	3	,	5	},
                    {	1	,	5	},
                    {	2	,	5	},
                    {	5	,	0	},
                    {	4	,	5	},
                    {	3	,	5	},
                    {	1	,	5	},
                    {	2	,	5	},
                    {	2	,	5	},
                    {	5	,	0	},
                    {	5	,	0	}
            };

    static final int[][] tab_1_1_values = new int[][]
            {
                    {	0	,	63	,	125	,	250	,	500	,	1000,	2000,	4000,	8000,	0	},
                    {	1	,	65	,	57	,	44	,	45	,	51	,	42	,	40	,	30	,	51	},
                    {	2	,	98	,	87	,	78	,	75	,	67	,	80	,	65	,	68	,	73	},
                    {	3	,	108	,	94	,	90	,	97	,	68	,	59	,	71	,	56	,	89	},
                    {	4	,	121	,	113	,	123	,	114	,	116	,	100	,	67	,	90	,	112	},
                    {	5	,	87	,	98	,	97	,	82	,	79	,	77	,	79	,	78	,	87	},
                    {	6	,	109	,	104	,	104	,	108	,	109	,	75	,	71	,	67	,	95	},
                    {	7	,	99	,	70	,	88	,	86	,	105	,	77	,	50	,	49	,	90	},
                    {	8	,	117	,	109	,	101	,	90	,	98	,	86	,	73	,	78	,	97	},
                    {	9	,	77	,	85	,	90	,	80	,	76	,	72	,	55	,	58	,	86	},
                    {	10	,	106	,	98	,	72	,	74	,	77	,	81	,	84	,	96	,	89	},
                    {	11	,	112	,	98	,	89	,	80	,	76	,	71	,	65	,	70	,	95	},
                    {	12	,	110	,	108	,	90	,	96	,	65	,	87	,	54	,	90	,	89	},
                    {	13	,	89	,	90	,	86	,	81	,	58	,	59	,	66	,	67	,	80	},
                    {	14	,	67	,	83	,	76	,	90	,	90	,	85	,	75	,	97	,	94	},
                    {	15	,	86	,	71	,	61	,	54	,	49	,	45	,	40	,	38	,	60	},
                    {	16	,	78	,	76	,	67	,	68	,	55	,	78	,	69	,	75	,	72	},
                    {	17	,	93	,	79	,	70	,	76	,	59	,	53	,	45	,	49	,	70	},
                    {	18	,	76	,	70	,	69	,	67	,	66	,	59	,	57	,	54	,	65	},
                    {	19	,	100	,	101	,	96	,	87	,	74	,	60	,	57	,	55	,	66	},
                    {	20	,	96	,	83	,	76	,	68	,	65	,	57	,	55	,	54	,	64	},
                    {	21	,	57	,	44	,	45	,	51	,	42	,	40	,	30	,	51	,	56	},
                    {	22	,	57	,	44	,	45	,	51	,	42	,	40	,	30	,	51	,	56	},
                    {	23	,	94	,	90	,	97	,	68	,	59	,	71	,	56	,	89	,	90	},
                    {	24	,	94	,	90	,	97	,	68	,	59	,	71	,	56	,	89	,	90	},
                    {	25	,	98	,	97	,	70	,	89	,	78	,	95	,	77	,	50	,	88	},
                    {	26	,	98	,	97	,	70	,	89	,	78	,	95	,	77	,	50	,	88	},
                    {	27	,	70	,	88	,	81	,	58	,	59	,	66	,	72	,	67	,	85	},
                    {	28	,	70	,	88	,	81	,	58	,	59	,	66	,	72	,	67	,	85	},
                    {	29	,	85	,	90	,	80	,	76	,	72	,	55	,	58	,	86	,	90	},
                    {	30	,	85	,	90	,	80	,	76	,	72	,	55	,	58	,	86	,	90	},
            };
    static final int[][] tab_1_2_default_values = new int[][]
            {
                    {	0	,	1	,	2	,	3	,	4	,	5	,	6	,	7	,	8	,	9	,	10	},
                    {	1	,	86	,	71	,	61	,	54	,	49	,	45	,	42	,	40	,	38	,	50	},
                    {	2	,	93	,	79	,	70	,	63	,	58	,	55	,	52	,	50	,	49	,	60	},
                    {	3	,	96	,	83	,	74	,	68	,	63	,	60	,	57	,	55	,	54	,	65	},
                    {	4	,	103	,	91	,	83	,	77	,	73	,	70	,	68	,	66	,	64	,	75	},
                    {	5	,	107	,	95	,	87	,	82	,	78	,	75	,	73	,	71	,	69	,	80	}
            };

    static final int[][] tab_2_1_values = new int[][]
            {
                    {	0	,	1	,	2	,	3	,	4	,	5   ,   6	},
                    {	1   ,  110	,	108	,	104	,	102	,	100	,   100	},
                    {	2   ,  116	,	115	,	115	,	112	,	114	,	116	},
                    {	3   ,  112	,	100	,	103	,	101	,	96	,	98	},
                    {	4   ,  110	,	102	,	105	,	103	,	101	,	90	},
                    {	5   ,   98	,	97	,	94	,	82	,	98	,	100	},

            };

    static final int[][] tab_2_2_values = new int[][]
            {
                    {	0	,	1	,	2	,	3	,	4	,	5	,	6	,	7	},
                    {	1	,	108	,	99	,	93	,	92	,	92	,	92	,	92	},
                    {	2	,	117	,	108	,	102	,	101	,	101	,	101	,	101	},
                    {	3	,	117	,	116	,	116	,	116	,	116	,	116	,	116	}
            };

    static int remember = 0;

    public static void Zero(){
        for (int i = 1; i<5;i++){
            if (((tab_1_1_values[num][i+1]) - tab_1_2_default_values[work_enums[num][0]][i+2]) > 10 )
            {
                remember = 1;
                break;
            }
        }
        if (remember == 1){
            work_enums[num][1] = work_enums[num][1] + 5;
        }
        First();
    }

    public static void First(){
        System.out.println("1. Вид трудової діяльності: " + tab_1_strings[num][1]);
        System.out.println("2. Розташування робочого місця, де вимірюється шум: " + tab_1_strings[num][3]);
        System.out.println("3. Джерело шуму: " + tab_1_strings[num][4]);
        String tab_1_1 = "| %-25s | %-15s | %-78s | %-6s |%n";
        String tab_1_2 = "| %-25s | %-15s | %-6s | %-6s | %-6s | %-6s | %-6s | %-6s | %-6s | %-6s | %-6s | %-6s |%n";
        String ras_tab_1_1 = "+---------------------------+-----------------+--------------------------------------------------------------------------------+--------+";
        String ras_tab_1_2 = "|                           |                 |--------+--------+--------+--------+--------+--------+--------+--------+--------+        |";
        String ras_tab_1_3 = "+---------------------------+-----------------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+";
        System.out.println(ras_tab_1_1);
        System.out.format(tab_1_1, "","", "Середньогеометричні частоти (f), Гц", "");
        System.out.println(ras_tab_1_2);
        System.out.format(tab_1_2, "Параметри","Позначення", "31,5", "63", "125", "250", "500", "1000", "2000", "4000", "8000", "дБА");
        System.out.println(ras_tab_1_3);
        System.out.format(tab_1_2, "Фактичні рівні шуму","", "  --", "", "", "", "", "", "", "", "", "");
        System.out.format(tab_1_2, "на робочому місці","  дБ", "  --" +
                "", tab_1_1_values[num][1]+" дБ", tab_1_1_values[num][2]+" дБ" +
                "", tab_1_1_values[num][3]+" дБ", tab_1_1_values[num][4]+" дБ" +
                "", tab_1_1_values[num][5]+" дБ", tab_1_1_values[num][6]+" дБ" +
                "", tab_1_1_values[num][7]+" дБ", tab_1_1_values[num][8]+" дБ", tab_1_1_values[num][9]+" дБ");
        System.out.format(tab_1_2, "    працівника","",         "  --", "", "", "", "", "", "", "", "", "");
        System.out.println(ras_tab_1_3);
        System.out.format(tab_1_2, "Граничні ","", "", "", "", "", "", "", "", "", "", "");
        System.out.format(tab_1_2, "допустимі","  дБ" +
                "", tab_1_2_default_values[work_enums[num][0]][1]+" дБ", tab_1_2_default_values[work_enums[num][0]][2]+" дБ" +
                "", tab_1_2_default_values[work_enums[num][0]][3]+" дБ", tab_1_2_default_values[work_enums[num][0]][4]+" дБ" +
                "", tab_1_2_default_values[work_enums[num][0]][5]+" дБ", tab_1_2_default_values[work_enums[num][0]][6]+" дБ" +
                "", tab_1_2_default_values[work_enums[num][0]][7]+" дБ", tab_1_2_default_values[work_enums[num][0]][8]+" дБ" +
                "", tab_1_2_default_values[work_enums[num][0]][9]+" дБ", tab_1_2_default_values[work_enums[num][0]][10]+" дБ");
        System.out.format(tab_1_2, "рівні шуму","", "", "", "", "", "", "", "", "", "", "");
        System.out.println(ras_tab_1_3);
        System.out.format(tab_1_2, "Поправка до ГДР","Не робиться;", (tab_1_2_default_values[work_enums[num][0]][1]-work_enums[num][1])+" дБ" +
                "", (tab_1_2_default_values[work_enums[num][0]][2]-work_enums[num][1])+" дБ", (tab_1_2_default_values[work_enums[num][0]][3]-work_enums[num][1])+" дБ" +
                "", (tab_1_2_default_values[work_enums[num][0]][4]-work_enums[num][1])+" дБ", (tab_1_2_default_values[work_enums[num][0]][5]-work_enums[num][1])+" дБ" +
                "", (tab_1_2_default_values[work_enums[num][0]][6]-work_enums[num][1])+" дБ", (tab_1_2_default_values[work_enums[num][0]][7]-work_enums[num][1])+" дБ" +
                "", (tab_1_2_default_values[work_enums[num][0]][8]-work_enums[num][1])+" дБ", (tab_1_2_default_values[work_enums[num][0]][9]-work_enums[num][1])+" дБ" +
                "", (tab_1_2_default_values[work_enums[num][0]][10]-work_enums[num][1])+" дБ");
        System.out.println(ras_tab_1_3);
        System.out.format(tab_1_2, "На скільки","", "  --", "", "", "", "", "", "", "", "", "");
        System.out.format(tab_1_2, "дБ перевищує","  дБ", "  --" +
                "", (tab_1_1_values[num][1] - (tab_1_2_default_values[work_enums[num][0]][1+1]))+" дБ" +
                "", (tab_1_1_values[num][2] - (tab_1_2_default_values[work_enums[num][0]][2+1]))+" дБ" +
                "", (tab_1_1_values[num][3] - (tab_1_2_default_values[work_enums[num][0]][3+1]))+" дБ" +
                "", (tab_1_1_values[num][4] - (tab_1_2_default_values[work_enums[num][0]][4+1]))+" дБ" +
                "", (tab_1_1_values[num][5] - (tab_1_2_default_values[work_enums[num][0]][5+1]))+" дБ" +
                "", (tab_1_1_values[num][6] - (tab_1_2_default_values[work_enums[num][0]][6+1]))+" дБ" +
                "", (tab_1_1_values[num][7] - (tab_1_2_default_values[work_enums[num][0]][7+1]))+" дБ" +
                "", (tab_1_1_values[num][8] - (tab_1_2_default_values[work_enums[num][0]][8+1]))+" дБ" +
                "", (tab_1_1_values[num][9] - (tab_1_2_default_values[work_enums[num][0]][9+1]))+" дБ");
        System.out.format(tab_1_2, "норму","", "  --", "", "", "", "", "", "", "", "", "");
        System.out.println(ras_tab_1_3);
        System.out.println("Висновок:");
        if( tab_1_1_values[num][9] <= (tab_1_2_default_values[work_enums[num][0]][9+1])){
            System.out.println("Рівень шуму в межах норми;\n"+
                               "Умови праці - допустимі;");
        }
        else if( tab_1_1_values[num][9] < 85){
            System.out.println("Рівень шуму перевищує норму ГДР;\n" +
                               "Умови праці - шкідливі; 1 ступінь;");
        }
        else if( tab_1_1_values[num][9] < 95){
            System.out.println("Рівень шуму перевищує норму ГДР;\n" +
                    "Умови праці - шкідливі; 2 ступінь;");
        }
        else if( tab_1_1_values[num][9] < 105){
            System.out.println("Рівень шуму перевищує норму ГДР;\n" +
                    "Умови праці - шкідливі; 3 ступінь;");
        }
        else if( tab_1_1_values[num][9] < 115){
            System.out.println("Рівень шуму перевищує норму ГДР;\n" +
                    "Умови праці - шкідливі; 4 ступінь;");
        }
        else {
            System.out.println("Рівень шуму перевищує норму ГДР;\n" +
                    "Умови праці - небезпечні;");
        }
        PreSecond();
    }

    public static void PreSecond(){

        Second();
    }
    public static void Second() {
        int local=0;    //Для данных с таблицы
        int local_2=0;  //Для данных ГДР
        switch (num) {
            case 1, 2, 11, 12, 21, 22 -> {
                local = 1;
                task_2_db = 112;
                task_2_hz = 63;
                local_2 = 1;
            }
            case 3, 4, 13, 14, 23, 24 -> {
                local = 2;
                task_2_db = 113;
                task_2_hz = 500;
                local_2 = 3;
            }
            case 5, 6, 15, 16, 25, 26 -> {
                local = 3;
                task_2_db = 114;
                task_2_hz = 500;
                local_2 = 2;
            }
            case 7, 8, 17, 18, 27, 28 -> {
                local = 4;
                task_2_db = 104;
                task_2_hz = 1000;
                local_2 = 1;
            }
            case 9, 10, 19, 20, 29, 30 -> {
                local = 5;
                task_2_db = 128;
                task_2_hz = 31.5;
                local_2 = 3;
            }
        }
        String tab_2_1 = "| %-87s | %-30s |%n";
        String tab_2_2 = "| %-15s | %-15s | %-51s | %-30s |%n";
        String tab_2_3 = "| %-15s | %-15s | %-6s | %-6s | %-6s | %-6s | %-6s | %-6s | %-30s |%n";
        String var_tab_2_1 = "+-----------------------------------------------------------------------------------------+--------------------------------+";
        String var_tab_2_2 = "+-----------------+-----------------+-----------------------------------------------------+--------------------------------+";
        String var_tab_2_3 = "+-----------------+-----------------+--------+--------+--------+--------+--------+--------+--------------------------------+";
        String var_tab_2_4 = "+                 |                 +-----------------------------------------------------+                                |";
        System.out.println(var_tab_2_1);
        System.out.format(tab_2_1, "Оцінка загальної вібрації на робочому місці №1", "Оцінка локальної вібрації");
        System.out.format(tab_2_1, "", "на робочому місці №2");
        System.out.println(var_tab_2_2);
        System.out.format(tab_2_2, "Параметри", "Позначення","Середньогеометричні частоти (f), Гц", "f = "+task_2_hz+" Гц");
        System.out.println(var_tab_2_4);
        System.out.format(tab_2_3, "", "", "2", "4", "8", "16", "31,5", "63", "");
        System.out.println(var_tab_2_3);
        System.out.format(tab_2_3, "Фактичні рівні", "", "", "", "", "", "", "", "");
        System.out.format(tab_2_3, "вібрації на",  "дБ",
                tab_2_1_values[local][1] + " дБ",
                tab_2_1_values[local][2] + " дБ",
                tab_2_1_values[local][3] + " дБ",
                tab_2_1_values[local][4] + " дБ",
                tab_2_1_values[local][5] + " дБ",
                tab_2_1_values[local][6] + " дБ",
                task_2_db + " дБ");
        System.out.format(tab_2_3, "робочому місці", "", "", "", "", "", "", "", "");
        System.out.format(tab_2_3, "працівника",     "", "", "", "", "", "", "", "");
        System.out.println(var_tab_2_3);
        System.out.format(tab_2_3, "Граничні",      "", "", "", "", "", "", "", "");
        System.out.format(tab_2_3, "допустимі",     "дБ",
                tab_2_2_values[local_2][1]+" дБ",
                tab_2_2_values[local_2][2]+" дБ",
                tab_2_2_values[local_2][3]+" дБ",
                tab_2_2_values[local_2][4]+" дБ",
                tab_2_2_values[local_2][5]+" дБ",
                tab_2_2_values[local_2][6]+" дБ",
                "112 дБ");
        System.out.format(tab_2_3, "рівні вібрації","", "", "", "", "", "", "", "");
        System.out.println(var_tab_2_3);
        System.out.format(tab_2_3, "На скільки",      "", "", "", "", "", "", "", "");
        System.out.format(tab_2_3, "дБ перевищує",     "дБ",
                (tab_2_1_values[local][1]-tab_2_2_values[local_2][1])+" дБ",
                (tab_2_1_values[local][2]-tab_2_2_values[local_2][2])+" дБ",
                (tab_2_1_values[local][3]-tab_2_2_values[local_2][3])+" дБ",
                (tab_2_1_values[local][4]-tab_2_2_values[local_2][4])+" дБ",
                (tab_2_1_values[local][5]-tab_2_2_values[local_2][5])+" дБ",
                (tab_2_1_values[local][6]-tab_2_2_values[local_2][6])+" дБ",
                (task_2_db-112)+" дБ");
        System.out.format(tab_2_3, "норму","", "", "", "", "", "", "", "");
        System.out.println(var_tab_2_3);
        System.out.println("Висновки:");

        max_number = tab_2_2_values[local_2][1];
        if (max_number < tab_2_2_values[local_2][2]){
            max_number = tab_2_2_values[local_2][2];
        }
        if (max_number < tab_2_2_values[local_2][3]){
            max_number = tab_2_2_values[local_2][3];
        }
        if (max_number < tab_2_2_values[local_2][4]){
            max_number = tab_2_2_values[local_2][4];
        }
        if (max_number < tab_2_2_values[local_2][5]){
            max_number = tab_2_2_values[local_2][5];
        }
        if (max_number < tab_2_2_values[local_2][6]){
            max_number = tab_2_2_values[local_2][6];
        }
        task_2_gdr_max = tab_2_2_values[local_2][7];
        Third();
    }

    public static void Third(){
        double local=0;

        if (max_number <= task_2_gdr_max)
        {
            System.out.println("1) Щодо загальної вібрації: Умови праці - допустимі;");
        }
        else if (max_number < 122){
            System.out.println("1) Щодо загальної вібрації: Умови праці - шкідливі; 1 ступінь;");
        }
        else if (max_number < 128){
            System.out.println("1) Щодо загальної вібрації: Умови праці - шкідливі; 2 ступінь;");
        }
        else if (max_number < 134){
            System.out.println("1) Щодо загальної вібрації: Умови праці - шкідливі; 3 ступінь;");
        }
        else if (max_number < 140){
            System.out.println("1) Щодо загальної вібрації: Умови праці - шкідливі; 4 ступінь;");
        }
        else {
            System.out.println("1) Щодо загальної вібрації: Умови праці - небезпечні;");
        }
        if (task_2_db <= 112)
        {
            System.out.println("2) Щодо локальної вібрації: Умови праці - допустимі;");
        }
        else if (task_2_db < 115){
            System.out.println("2) Щодо локальної вібрації: Умови праці - шкідливі; 1 ступінь;");
        }
        else if (task_2_db < 118){
            System.out.println("2) Щодо локальної вібрації: Умови праці - шкідливі; 2 ступінь;");
        }
        else if (task_2_db < 121){
            System.out.println("2) Щодо локальної вібрації: Умови праці - шкідливі; 3 ступінь;");
        }
        else if (task_2_db < 124){
            System.out.println("2) Щодо локальної вібрації: Умови праці - шкідливі; 4 ступінь;");
        }
        else {
            System.out.println("2) Щодо локальної вібрації: Умови праці - небезпечні;");
        }
        System.out.println("Розробка профілактичних заходів:");
        /* */

        if (task_2_db-112 == 0)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну зменшувати не потрібно!");
        }
        else if (task_2_db-112 == 1)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 384 хвилин;");
        }
        else if (task_2_db-112 == 2)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 302 хвилин;");
        }
        else if (task_2_db-112 == 3)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 240 хвилин;");
        }
        else if (task_2_db-112 == 4)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 191 хвилин;");
        }
        else if (task_2_db-112 == 5)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 151 хвилин;");
        }
        else if (task_2_db-112 == 6)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 120 хвилин;");
        }
        else if (task_2_db-112 == 7)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 95 хвилин;");
        }
        else if (task_2_db-112 == 8)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 76 хвилин;");
        }
        else if (task_2_db-112 == 9)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 60 хвилин;");
        }
        else if (task_2_db-112 == 10)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 48 хвилин;");
        }
        else if (task_2_db-112 == 11)
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 38 хвилин;");
        }
        else
        {
            System.out.println("2) Проти впливу вібрації: Допустимий сумарний час дії вібрації за зміну = 30 хвилин;");
        }

        {
            System.out.println("Профілактичні заходи від шуму:");
            System.out.println("- замінити зворотно-поступального переміщення деталей обертовим;\n" +
                    "- підвищити якості балансування деталей;\n" +
                    "- удосконалити кінематичних схем;\n" +
                    "- замінити підшипники кочення на підшипники ковзання;\n" +
                    "- застосування деталей з капрону, текстоліту;\n" +
                    "- ліквідації люфтів, перекосів деталей;\n" +
                    "- обладнання приміщень глушниками шуму");
            System.out.println("Засоби індивідуального захисту поділяють на:\n" +
                    "- протишумові вкладиші (закривають вушну раковину зовні);\n" +
                    "- протишумові навушники (перекривають слуховий прохід);\n" +
                    "- протишумові каски і шоломи (закривають всю голову і " +
                    "застосовуються у сполученні з навушниками і протишумовими костюмами);\n" +
                    "- протишумові захисні пристрої з електронним приймачем;\n" +
                    "- протишумові захисні пристрої з телефонним зв’язком.");
            System.out.println("Профілактичні заходи від вібрації:");
            System.out.println("- зниження вібрацій в джерелі виникнення шляхом зниження або " +
                    "усунення збуджувальних сил;\n" +
                    "- відлагодження від резонансних режимів раціональним вибором " +
                    "приведеної маси або жорсткості системи, котра коливається;\n" +
                    "- вібродемпфірування – зниження вібрацій за рахунок сили тертя " +
                    "демпфірного пристрою, тобто переведення коливної енергії в тепло;12\n" +
                    "- динамічне гасіння – введення в коливну систему додаткових мас " +
                    "або збільшення жорсткості системи;\n" +
                    "- віброізоляція – введення в коливну систему додаткового " +
                    "пружного зв'язку, з метою послаблення передавання вібрацій суміжному " +
                    "елементу конструкції або робочому місцю." +
                    "- зменшення вібрації у джерелі виникнення (конструктивними та технологічними методами);\n" +
                    "- зменшення вібрації на шляху розповсюдження засобами " +
                    "віброізоляції та вібропоглинання;\n" +
                    "- перевірка наявності вібраційних характеристик (ВХ) у паспортах " +
                    "на машини;\n" +
                    "- своєчасний ремонт машин;\n" +
                    "- використання машин за призначенням;\n" +
                    "- до експлуатації повинні допускатися тільки справні машини\n");
        }
        Final();
    }
    public static void Final(){
        System.out.print("\n==");
        System.out.print("\nВисновки:");
        System.out.print("""
                В ході виконання практичної роботи, я навчився та закріпив на практиці як оцінити шуми та вібрації на виробництві.
                Роботу виконав - ПІБ - підпис
                Роботу перевірив - Сергеєва Любов Анатоліївна - ______
                ==
                Пару пояснений:
                    Работа делалась по указанием препадователя;
                    П_загальний - все что идет после нижнего подчеркивания пишется в нижнем индексе
                    """);
        System.out.print("\n");
    }
    public static void main()
    {
        System.out.print("""
                Практичне Заняття № 10\040
                « Дослідження та оцінка шуму та вібрації на виробництві »""");
        System.out.print("\n");
        Scanner in = new Scanner(System.in);
        System.out.print("Введите вариант: ");
        num = in.nextInt();
        Zero();
    }
}
